from utils.telegram import auto_delete

async def help_handler(client, update):
    await update.edit("""
• **برای دیدن وضعیت ربات**: بنویسید وضعیت 
• **برای دیدن سرگرمی ربات**: بنویسید سرگرمی 

• **برای خاموش کردن ربات**: /off
• **برای روشن کردن ربات**: /on

• **برای خاموش کردن تغییر نام**: /timeoff
• **برای روشن کردن ساعت در تغییر نام**: /timeon
• **برای تغییر فونت ساعت تایم**: /font 0,1,2,3,4,5,6,7,8,9,:

• **برای خاموش کردن ادیت مسیج**: /editoff
• **برای روشن کردن ادیت مسیج**: /editon
• **برای تنظیم سرعت ادیت مسیج**: /settime <زمان به ثانیه>
""")
    await auto_delete(update)
